# Advanced concepts in Pandas

## Agenda

- Introduction to Dataframes and series
- Loading data from different sources
- Indexing and selecting Data
- Dataframe operations
- Data normalization and missing data
- Visualization
- Time Series analysis

## Introduction to Dataframes and series

### Series

Series is a one-dimensional labelled array capable of holding any datatype(int, float, string, python objects etc). The axis labells are collectively labelled as an index.

In [3]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

Creating pandas series   
series = pd.Series(data, index=index)  

Here data can be of type dict, ndaaray or scalar values  
index is a list of labels

### Series creation

In [7]:
series = pd.Series(np.random.rand(5), index=['a', 'b', 'c', 'd', 'e'])
print(series)
print(series.index)

a    0.735555
b    0.680997
c    0.615432
d    0.711600
e    0.501826
dtype: float64
Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [12]:
# Creating series from dict

dict = {'a': 1, 'b': 2, 'c': 3, 'd': 4}
series = pd.Series(dict)
series

a    1
b    2
c    3
d    4
dtype: int64

### Operations

In [22]:
#Data access

print(series['a']) #Accessing with key
print(series[1]) #Accessing using index
print(series[:2]) #Accessing using index range
print(series[series > 2]) #Conditional access
print(series.get('a')) ##Accessing using get

1
2
a    1
b    2
dtype: int64
c    3
d    4
dtype: int64
1
10
a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [24]:
#Arthematic operations

print(np.sum(series)) #Sum
print(np.exp(series)) #Exponential operation

10
a     2.718282
b     7.389056
c    20.085537
d    54.598150
dtype: float64

In [28]:
#Vectorized operations and label alignment with Series

print(series + series) #Adding two series 

print(series * 2) #multiplication of series object with scalar value

a    2
b    4
c    6
d    8
dtype: int64
a    2
b    4
c    6
d    8
dtype: int64

In [33]:
#Series name attribute

series = pd.Series(np.random.rand(3), index = ['a', 'b', 'c'], name='numbers')
print(series)
series = series.rename('numbers-2')
print(series)

a    0.950003
b    0.973488
c    0.056263
Name: numbers, dtype: float64
a    0.950003
b    0.973488
c    0.056263
Name: numbers-2, dtype: float64

## Dataframes

Dataframe is 2-dimensional labelled data structure with columns of potentially different types.   
Daataframes are similar to spreadsheet, sql tables or dictionary of series objects. This the widely used datastructure in pandas. Dataframe accepts various inputs such as

- dict of 1d array, lists, dicts or series
- 2-d numpy ndarray.
- structured or record nd-array
- series
- another dataframe

### Creation from dictionaries

In [40]:

data = {'one': pd.Series(np.random.rand(4), index=['a', 'b', 'c', 'd']),
       'two': pd.Series(np.random.rand(4), index=['a', 'b', 'c', 'v'])}

df = pd.DataFrame(data)
df

        one       two
a  0.029777  0.137266
b  0.123366  0.136394
c  0.543267  0.327074
d  0.581538       NaN
v       NaN  0.271480

In [44]:
df = pd.DataFrame(data, index=['a', 'b', 'c'], columns=['two', 'three'])
df

        two three
a  0.137266   NaN
b  0.136394   NaN
c  0.327074   NaN

In [46]:
df.index

Index(['a', 'b', 'c'], dtype='object')

In [48]:
df.columns

Index(['two', 'three'], dtype='object')

### From records

In [52]:
data = np.zeros((2, ), dtype=[('A', 'i4'), ('B', 'f4'), ('C', 'a10')])
data[:] = [(1, 2., 'Hello'), (2, 3., "World")]
df = pd.DataFrame(data)
df

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

### From list of dictionaries

In [54]:
data2 = [{'a': 1, 'b': 2}, {'a': 5, 'b': 10, 'c': 20}]
df = pd.DataFrame(data2)
df

   a   b     c
0  1   2   NaN
1  5  10  20.0

### From dict of Tuples

In [61]:
data = {('A', 1, 2), ('B', 3, 5), ('C', 4, 6)}
df = pd.DataFrame(data, columns=['one', 'two', 'three'])
df

  one  two  three
0   B    3      5
1   C    4      6
2   A    1      2

## Loading data from different sources

In [64]:
#Reading from csv file
df = pd.read_csv('../hour.csv')
df.head()

,instant,dteday,season,yr,mnth,hr,holiday,weekday,workingday,weathersit,temp,atemp,hum,windspeed,casual,registered,cnt
0,1,2011-01-01,1,0,1,0,0,6,0,1,0.24,0.2879,0.81,0.0,3,13,16
1,2,2011-01-01,1,0,1,1,0,6,0,1,0.22,0.2727,0.80,0.0,8,32,40
2,3,2011-01-01,1,0,1,2,0,6,0,1,0.22,0.2727,0.80,0.0,5,27,32
3,4,2011-01-01,1,0,1,3,0,6,0,1,0.24,0.2879,0.75,0.0,3,10,13
4,5,2011-01-01,1,0,1,4,0,6,0,1,0.24,0.2879,0.75,0.0,0,1,1

In [66]:
#Saving the dataframe as json file
df.to_json('../hour.json')

In [70]:
#Reading from json file
df = pd.read_json('../hour.json')
df.head()

,atemp,casual,cnt,dteday,holiday,hr,hum,instant,mnth,registered,season,temp,weathersit,weekday,windspeed,workingday,yr
0,0.2879,3,16,2011-01-01,0,0,0.81,1,1,13,1,0.24,1,6,0.0000,0,0
1,0.2727,8,40,2011-01-01,0,1,0.80,2,1,32,1,0.22,1,6,0.0000,0,0
10,0.3939,12,36,2011-01-01,0,10,0.76,11,1,24,1,0.38,1,6,0.2537,0,0
100,0.1970,6,115,2011-01-05,0,9,0.37,101,1,109,1,0.22,1,3,0.3284,1,0
1000,0.3939,7,256,2011-02-14,0,8,0.40,1001,2,249,1,0.38,1,1,0.4627,1,0

In [72]:
#Storing as picke file

df.to_pickle('../hour.pkl')

In [74]:
#Reading from pickle fie

df = pd.read_pickle('../hour.pkl')
df.head()

,atemp,casual,cnt,dteday,holiday,hr,hum,instant,mnth,registered,season,temp,weathersit,weekday,windspeed,workingday,yr
0,0.2879,3,16,2011-01-01,0,0,0.81,1,1,13,1,0.24,1,6,0.0000,0,0
1,0.2727,8,40,2011-01-01,0,1,0.80,2,1,32,1,0.22,1,6,0.0000,0,0
10,0.3939,12,36,2011-01-01,0,10,0.76,11,1,24,1,0.38,1,6,0.2537,0,0
100,0.1970,6,115,2011-01-05,0,9,0.37,101,1,109,1,0.22,1,3,0.3284,1,0
1000,0.3939,7,256,2011-02-14,0,8,0.40,1001,2,249,1,0.38,1,1,0.4627,1,0

In [83]:
#Reading from database

import sqlite3
sql = sqlite3.connect("../tripadvisor.db")

In [87]:
#The documents are stored in the "documents" table. This will now be read into a DataFrame.
docs = pd.read_sql_query("SELECT * FROM documents", sql, parse_dates=["time"])

In [86]:
docs.head()

,id,thread_id,topic,title,content,time,links,url,user_name
0,31,28,Student hangouts at NYU,,What are the popular hangouts at NYU? I will b...,2004-08-26 16:58:00,{},None,takjf
1,45,38,Favorite restaurant repeat visits in Manhattan,,I don't get to the city often so I normally do...,2004-08-26 17:43:00,"{""Park Avenue"",""Union Square Cafe""}",None,Jpan99
2,74,65,Park and ride the Train into NYC,,If you are coming from upstate NY and want to ...,2004-08-26 22:41:00,"{NYC,""Metro North"",Poughkeepsie,""Grand Central...",None,Tweetypez
3,213,157,The Big Apple with 5 year old,,I have a five-year-old boy who LOVES buildings...,2004-08-27 21:33:00,"{NYC,""Bronx Zoo"",""Empire State Building""}",None,TGlenn04
4,239,179,Upper East Side hotel search,,Looking for hotel or B&B in area near 200 East...,2004-08-28 01:00:00,"{""Upper East Side""}",None,mom

## Indexing and selecting Data

### Dataframe column access

In [99]:
docs['user_name'].head() #Accessing single column

0        takjf
1       Jpan99
2    Tweetypez
3     TGlenn04
4          mom
Name: user_name, dtype: object

In [101]:
docs.user_name.head()

0        takjf
1       Jpan99
2    Tweetypez
3     TGlenn04
4          mom
Name: user_name, dtype: object

In [103]:
docs.user_name.values #Getting the array of values

array(['takjf', 'Jpan99', 'Tweetypez', ..., 'SINYTraveler',
       'dolceincorso', 'Northern_Traveler00'], dtype=object)

In [98]:
docs[['user_name', 'topic']].head() #Accessing two attributes

   user_name                                           topic
0      takjf                         Student hangouts at NYU
1     Jpan99  Favorite restaurant repeat visits in Manhattan
2  Tweetypez                Park and ride the Train into NYC
3   TGlenn04                   The Big Apple with 5 year old
4        mom                    Upper East Side hotel search

### Sclicing ranges

In [106]:
docs[:5] #accessing first five records

,id,thread_id,topic,title,content,time,links,url,user_name
0,31,28,Student hangouts at NYU,,What are the popular hangouts at NYU? I will b...,2004-08-26 16:58:00,{},None,takjf
1,45,38,Favorite restaurant repeat visits in Manhattan,,I don't get to the city often so I normally do...,2004-08-26 17:43:00,"{""Park Avenue"",""Union Square Cafe""}",None,Jpan99
2,74,65,Park and ride the Train into NYC,,If you are coming from upstate NY and want to ...,2004-08-26 22:41:00,"{NYC,""Metro North"",Poughkeepsie,""Grand Central...",None,Tweetypez
3,213,157,The Big Apple with 5 year old,,I have a five-year-old boy who LOVES buildings...,2004-08-27 21:33:00,"{NYC,""Bronx Zoo"",""Empire State Building""}",None,TGlenn04
4,239,179,Upper East Side hotel search,,Looking for hotel or B&B in area near 200 East...,2004-08-28 01:00:00,"{""Upper East Side""}",None,mom

In [112]:
docs[-5:] #Accessing last five document

,id,thread_id,topic,title,content,time,links,url,user_name
1605587,93134017,11715212,Weekend Visit Itinerary,Re: Weekend Visit Itinerary,Agree you will probably get to your hotel abou...,2018-07-03 20:42:00,"{JFK,""Central Park""}",None,nytraveler2016
1605588,93134529,11716035,Restaurant by Pier 83,Re: Restaurant by Pier 83,Legacy records is a hot new restaurant in easy...,2018-07-03 21:26:00,{},None,here&there
1605589,93135489,11715780,Traveling to the Game from southeast NY.,Re: Traveling to the Game from southeast NY.,For readers who may want to take Metro North b...,2018-07-03 23:06:00,"{""Metro North"",mta.info/mnr/html/yankees/yank...",None,SINYTraveler
1605590,93137471,11713961,I just can't decide which neighborhood...,Re: I just can't decide which neighborhood...,"Lizzieandlzzy, actually my son asked me to inc...",2018-07-04 00:53:00,{},None,dolceincorso
1605591,93142799,11716035,Restaurant by Pier 83,Re: Restaurant by Pier 83,We had a very nice dinner earlier this year at...,2018-07-04 06:10:00,"{Elizabeth,Becco}",None,Northern_Traveler00

In [117]:
docs.iloc[:5, 0:1] #five rows of first column

    id
0   31
1   45
2   74
3  213
4  239

In [120]:
docs.iloc[0] #First row of the document

id                                                          31
thread_id                                                   28
topic                                  Student hangouts at NYU
title
content      What are the popular hangouts at NYU? I will b...
time                                       2004-08-26 16:58:00
links                                                       {}
url                                                       None
user_name                                                takjf
Name: 0, dtype: object

In [125]:
docs.iloc[:, -1].head() #Last column of the document

0        takjf
1       Jpan99
2    Tweetypez
3     TGlenn04
4          mom
Name: user_name, dtype: object

**NOTE:** iloc returns series when single columns is selected or dataframe will be returned.

In [128]:
docs.loc[1] ##Location based access

id                                                          45
thread_id                                                   38
topic           Favorite restaurant repeat visits in Manhattan
title
content      I don't get to the city often so I normally do...
time                                       2004-08-26 17:43:00
links                      {"Park Avenue","Union Square Cafe"}
url                                                       None
user_name                                               Jpan99
Name: 1, dtype: object

In [131]:
docs.loc[[10, 11], ['id', 'user_name']] #Accessing specific columns using location

     id user_name
10  403     sworl
11  404     sworl

In [134]:
docs.loc[docs['user_name'] == 'Tweetypez'] ##Boolean or logical indexing using loc

,id,thread_id,topic,title,content,time,links,url,user_name
2,74,65,Park and ride the Train into NYC,,If you are coming from upstate NY and want to ...,2004-08-26 22:41:00,"{NYC,""Metro North"",Poughkeepsie,""Grand Central...",None,Tweetypez

In [139]:
docs.loc[docs['user_name'] == 'Tweetypez', 'topic'] ##Accessing specific column based on the condition

2    Park and ride the Train into NYC
Name: topic, dtype: object

## Dataframe operations

### Simple aggregated functions

In [ ]:
docs = docs[:100]
docs.mean()

### GroupBy: Split, Apply, Combine